# Computando estadística agregada/sumativa

Es posible realizar en Pandas diferentes cálculos tipicos sumativos básicos de la estadística:

In [2]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

GradeList = zip(names,grades)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades'])

df

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [3]:
df['Grades'].count() # number of values

5

In [4]:
df['Grades'].mean() # arithmetic average

85.0

In [5]:
df['Grades'].std() # standard deviation

11.067971810589327

In [6]:
df['Grades'].min() # minimum

76

In [7]:
df['Grades'].max() # maximum

99

In [8]:
df['Grades'].quantile(.25) # first quartile

77.0

In [9]:
df['Grades'].quantile(.5) # second quartile

78.0

In [10]:
df['Grades'].quantile(.75) # third quartile

95.0

Varias medidas de tendencia central:

In [11]:
# mean = dividing the sum by the number of values
df['Grades'].mean()

85.0

In [12]:
# median = the middle value if they are sorted in order
df['Grades'].median()

78.0

In [13]:
# mode = the most common single value
df['Grades'].mode()

0    76
1    77
2    78
3    95
4    99
Name: Grades, dtype: int64

Calculando la varianza:

In [14]:
# computes the variance of the values in a column
df['Grades'].var()

122.5

In [15]:
# Calculando la varianza a partir de la desviación estandar:

df['Grades'].std() ** 2

122.49999999999999

Es posible calcular la varianza sobre todas las columnas numéricas:

In [18]:
df.var()

/tmp/ipykernel_1246/1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Grades    122.5
dtype: float64

## Ej-1 Estadística sumativa 

Para el siguiente Dataframe calcula la estadística sumativa para los siguientes datos. Crea el dataset correspondiente:

In [19]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

# Estadística sumativa sobre filtros de renglones

In [20]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bs = [1,1,0,0,1]
ms = [2,1,0,0,0]
phd = [0,1,0,0,0]
GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Name','Grade','BS','MS','PhD'])

df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

Contando el número de personas que no tienen doctorado:

In [22]:
df.loc[df['PhD']==0]['PhD'].count()

4

Calculando la calificación promedio de los que no tienen doctorado:

In [23]:
df.loc[df['PhD']==0]['Grade'].mean()

82.5

# Ej-2 Calculando promedios con dataframes con filtros

Para el siguiente dataframe calcula el promedio de los estudiantes que tienen grado de maestría:

In [25]:
import pandas as pd

names = ['Bob','Jessica','Mary','John', 'Mel','Sam','Cathy','Henry','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bs = [1,1,0,0,1,1,1,0,1]
ms = [2,1,0,0,0,1,1,0,0]
phd = [0,1,0,0,0,2,1,0,0]

GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS','MS','PhD'])

df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0
5      Sam      84   1   1    2
6    Cathy      79   1   1    1
7    Henry     100   0   0    0
8    Lloyd      73   1   0    0

# Ordenando los datos

Es posible ordenar los datos de forma ascendente o descendente. Muy útil para muchos cálculos en Dataframes.

In [1]:
import pandas as pd

Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [3]:
df = df.sort_values(by='age', ascending=0)
df

,fname,lname,gender,age,exercise,hours,grade,address
1000,Hanna,Mooney,female,19,2,10,88.8,"8293 SW. Cedar Swamp Lane, Union, NJ 07083"
1249,Hyatt,Mcintosh,male,19,3,11,82.3,"41 Hilltop St., Oak Ridge, TN 37830"
1292,Shannon,Whitley,female,19,1,10,78.1,"8105 Plymouth Street, Palos Verdes Peninsula, ..."
1290,Oprah,Walker,female,19,2,6,69.7,"58 West Riverside St., Mableton, GA 30126"
1288,Griffith,Swanson,male,19,4,4,78.5,"9505 Ocean St., Dallas, GA 30132"
...,...,...,...,...,...,...,...,...
1175,Nyssa,Vincent,female,14,2,6,73.1,"158 Adams Rd., Marysville, OH 43040"
755,Carol,Graves,female,14,4,12,79.7,"28 Sutor Street, Kissimmee, FL 34741"
1180,Rahim,Tucker,male,14,4,8,76.2,"311 Walnutwood Court, Mechanicsburg, PA 17050"
753,Scott,Mueller,male,14,4,6,73.8,"9543 Tower St., Grand Island, NE 68801"
294,Illiana,Branch,female,14,5,4,69.8,"9730 Van Dyke Court, Port Orange, FL 32127"

In [9]:
df = df.sort_values(by=['grade', 'age'], ascending=[True, True])

df.tail()

,fname,lname,gender,age,exercise,hours,grade,address
457,Myra,Parrish,female,19,5,15,100.0,"854 3rd Ave., Nanuet, NY 10954"
868,Craig,Moses,male,19,4,19,100.0,"7218 Grove Rd., Melbourne, FL 32904"
621,Gwendolyn,Vazquez,female,19,5,19,100.0,"550 Selby St., Louisville, KY 40207"
321,Lysandra,Copeland,female,19,5,19,100.0,"20 Talbot Drive, Fort Lauderdale, FL 33308"
508,Dai,Osborne,female,19,5,20,100.0,"2 Pilgrim Road, Alexandria, VA 22304"

## Ej-3 Ordenamiento

¿Podrías ordenar el dataframe por nombre, edad y grado?

In [ ]:
#Ej-3 ....

## Correlación entre los datos

Permite encontrar la correlación entre parejas de datos.

In [10]:
import pandas as pd

Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [14]:
df.corr()

               age  exercise     hours     grade
age       1.000000 -0.003643 -0.017467 -0.007580
exercise -0.003643  1.000000  0.021105  0.161286
hours    -0.017467  0.021105  1.000000  0.801955
grade    -0.007580  0.161286  0.801955  1.000000

# Ej-4 Correlaciones

Encuentra todas las correlaciones entre los campos de datasets/tamiami.csv

In [15]:
# Ej-4

import pandas as pd

Location = "datasets/tamiami.csv"

## Regresion

En modelado estadístico, el análisis de regresión es un proceso estadístico para estimar la relación entre variables. Buscamos crear una ecuación que explique el valor de una variable dependiente basado en otras variables independientes.